---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FlexibleInstanceFlip
source: html/8bbb1871-2b33-bb00-2541-695f0779fc61.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FlexibleInstanceFlip Property

"Flip"

## Syntax (C#)
```csharp
public static ForgeTypeId FlexibleInstanceFlip { get; }
```